<template>
	<div class="xieyi">
	<div class="artic">
		<h1>草莓商城产品服务协议</h1>
		<p>本协议是用户（以下简称“您”）与草莓商城APP（以下简称“本APP”）所有者宁波草莓网络科技有限公司 (以下简称为“草莓商城”）之间就草莓商城APP提供服务等相关事宜所订立的契约， 请您仔细阅读本服务协议，一旦您通过本APP提交用户注册申请，即意味着您已阅读本协议所有条款，并对本协议条款的含义及相应的法律后果已全部通晓并充分理解，同意受本协议约束。</p>
		<p>第1条   本APP服务条款的确认和接纳</p>
		<p>1.1. 本APP的各项电子服务的所有权和运作权归草莓商城所有。您同意所有服务协议条款并完成注册程序，才能成为本APP的正式用户。您确认：本协议条款是处理双方权利义务的依据，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定或约定。</p>
		<p>1.2. 您使用本APP提供的服务时，应同时接受本APP已经发布的或将来可能发布的特定服务、活动等的准则、条款和协议（以下统称为“其他条款”）； 如果本协议与“其他条款”有不一致之处，则以“其他条款”为准。</p>
		<p>1.3. 草莓商城有权根据需要不时地修改本协议及其它条款，一旦本协议或其它条款内容发生变动，本APP不再另行单独做出通知。您应不时地注意本协议及具体规则的变更， 若您在本协议或其它条款内容发生变动后继续使用本APP及服务的，表示您已充分阅读、理解并接受修改后的协议及其它条款，也将遵循修改后的协议和具体规则使用本APP服务；若您不同意修改后的协议或其它条款内容，您有权立即停止使用本APP服务。</p>
		<p>1.4. 您确认，如果您在18周岁以下，您只能在父母或其他监护人的监护参与下才能使用本APP。</p>
		<p>1.5. 您点击同意或勾选同意本协议的，即视为您确认自己具有享受本APP服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。 </p>
		<p>1.6. 草莓商城保留在中华人民共和国大陆地区施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</p>
		<p>1.7. 您应不时关注并遵守本APP不时公布或修改的各类规则规定。本APP保有删除站内各类不符合法律政策或不真实的信息内容而无须通知您的权利。</p>
		<p>第2条   用户信息说明</p>
		<p>2.1. 您应自行诚信向本APP提供注册资料，您保证提供的注册资料真实、准确、完整、合法有效，您的注册资料如有变动的，应及时更新其注册资料。如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且草莓商城保留单方终止您使用本APP及其合作伙伴各项服务的权利。</p>
		<p>2.2. 您在本APP进行注册、浏览、下单、评价、参加活动等行为时，涉及您真实姓名/名称、通信地址、联系电话、电子邮箱、订单详情、评价或反馈、投诉内容、cookies 等信息的，本APP有权从完成交易、提供配送、售后及客户服务、开展活动、完成良好的客户体验等多种角度予以收集，并将对其中涉及个人隐私信息予以严格保密，除非得到您的授权、为履行强行性法律义务（如国家安全机关指令）或法律另有规定、本注册协议或其他条款另有约定外，本APP不会向外界披露您的隐私信息。 </p>
		<p>2.3. 您注册成功后，将产生用户名和密码等账户信息，您可以根据本APP规定更改您的密码。您应谨慎合理的保存、使用您的账户信息。您若发现任何非法使用您的账户或其他存在安全漏洞的情况的，请立即通知本APP并向公安机关报案。</p>
		<p>2.4. 您同意：草莓商城拥有通过邮件、短信、电话、网站通知或声明等形式，向在本APP注册、交易的用户发送订单信息、促销活动、售后服务、客户服务等告知信息的权利。 </p>
		<p>2.5. 您同意：您选择向您自己提供的商品销售商或服务提供商，或本APP推荐或指派的商品销售商或服务提供商（以下统称为“销售商”）提交订单购买商品或服务的，视为您向商品销售商或服务提供商披露个人相关信息，接受其向您提供商品销售、服务提供、配送、售后服务、客户服务、处理信用卡付款、数据分析、市场营销帮助或其他必要事宜；如前述全部或部分事宜之一涉及由商品销售商或服务提供商外的第三方履行的，其有权将您的信息以必要方式向第三方披露，第三方有权以履行上述事宜为目的联系您。</p>
		<p>2.6. 您同意：您注册成功产生的用户名及密码等账户信息的所有权及其衍生的包括但不限于知识产权归属于草莓商城，草莓商城有权使用您的注册信息、用户名、密码等信息，登录进入您的注册账户，进行证据保全，包括但不限于公证、见证、协助司法机关进行调查取证等。</p>
		<p>第3条   用户信用</p>
		<p>3.1. 您同意：为了确定您的真实身份，评价您的信用状况，确认您的订约、履约意愿，识别、控制交易中的风险，草莓商城有权在您使用本APP服务的期间向依法设立的征信机构或数据服务提供商查询您的信用及相关个人信息。当您使用本APP服务但对本APP或本APP的其他用户产生违约情形时，草莓商城可以向前述征信机构或数据服务提供商查询能够联系到您的信息，包括但不限于电话号码、电子邮件地址、地址、邮编等，用于追究违约责任。 为了查询这些信息的需要，草莓商城可以将您的姓名、公民身份号码提交给前述征信机构用以确定被查询其信息的信息主体。</p>
		<p>3.2. 您同意：草莓商城可以将您在使用本APP服务期间产生的相关信息提供给依法设立的征信机构。 </p>
		<p>第4条   本APP服务</p>
		<p>4.1. 草莓商城通过互联网依法为您提供互联网信息、互联网平台等服务，具体以草莓商城在本APP提供的服务为准，您在完全同意本协议及本APP相关规定的情况下，方有权使用本APP的相关服务。 </p>
		<p>4.2. 您必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于手机或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、 手机流量费等。因需您自行准备的设备或承担的开支存在瑕疵而导致交易失败，本APP不承担任何责任。</p>
		<p>第5条   商品及服务信息</p>
		<p>5.1. 本APP上的商品或服务的价格、数量、是否有货等信息随时都有可能发生变动，本APP不作特别通知。由于网站上信息数量庞大，虽然本APP会尽最大努力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本APP网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解；</p>
		<p>5.2. 您在此表示充分理解以下表述：商品本身的销售商或服务商由您自行选择，或者由草莓商城以商品展示的形式向您推荐（“推荐”并不意味着草莓商城提供任何形式的担保）。 对于商品或服务本身，您拥有作为消费者的一切合法权利，草莓商城虽然同意会配合您向商品销售商或服务商行使消费者权利，但草莓商城在此声明，您与商品销售商或服务商之间基于商品买卖或提供服务产生的任何纠纷， 包括但不限于：商品的寄送、质量、售后服务及您与销售商或服务商在合同中约定的其他权利义务等纠纷，与草莓商城没有任何法律上或合同上的关联。 </p>
		<p>第6条   订单</p>
		<p>6.1. 在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、联系地址、电话、收货人（包括接受本APP商品服务商所提供服务的人，以下统称“收货人”）等信息。收货人与您本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任，您可以随时登录您在本APP注册的账户，查询您的订单状态。 </p>
		<p>6.2. 除法律另有强制性规定外，双方约定如下：本APP上商品的销售商及服务商展示的商品、服务和价格等信息仅仅是要约邀请，您下单时须填写您希望购买的商品或希望接受服务的数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、 合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售商或服务商发出的合同要约；销售商或服务商收到您的订单信息后，只有在销售商或服务商将您在订单中订购的 商品实际直接向您发出时或实际就您订购的商品服务与您进行联系时，方视为您与销售商或服务商之间就前述商品及服务建立了合同关系；您确认并同意，如您成功与销售商或服务商建立了合同关系，交易则不可取消或退款，您就该购买商品或所接受的服务所产生的一切纠纷均为您与第三方销售商或服务商之间的责任，您应自行与第三方销售商或服务商解决纠纷，如您需要，草莓商城可视情况会配合您向商品销售商或服务商进行沟通，但草莓商城不对销售商或服务商为您提供商品或服务进行保证，亦不承担任何责任。</p>
		<p>第7条   配送</p>
		<p>7.1. 您知晓：如您在本APP成功下单，则视为您接受并认可本APP销售商或服务商，且您同意销售商或服务商按其方式配送或向您提供服务（具体方式以销售商或服务商提供的为准），本APP将会按前述方式把商品送到您所指定的收货地址或按指定的地址进行服务，所有在本APP上列出的送货或服务时间为参考时间，参考时间的计算是正常的处理过程和送货时间、送货地点等相关信息估计得出的。</p>
		<p>7.2. 因如下情况造成订单延迟或无法配送、交货等，本APP不承担相关责任： 1) 您提供的信息错误、地址不详细等原因导致的； 2) 货物送达后无人签收，导致无法配送或延迟配送的； 3) 情势变更因素导致的； 4) 未能在本APP所示的送货参考时间内送货的； 5) 因节假日、大型促销活动、店庆、预购或抢购人数众多等原因导致的； 6) 不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。 </p>
		<p>第8条   款项的支付</p>
		<p>8.1. 您了解并知悉，您通过本APP购买商品或享受本APP服务商提供的服务所需支付的货款或费用可以采取分期支付，因您的支付方式涉及第三方机构或与第三方机构相关联， 您同意，一旦您同意本协议，即视为您同意与第三方之间关于支付款项的相关协议规则，您认可并保证按照您与第三方签订的关于款项支付的协议支付相关费用。</p>
		<p>8.2. 您同意，关于款项的支付是您与第三方之间的合同/协议关系，因您在本APP购买或享受服务而需支付的费用涉及到的相关问题及纠纷与本APP无关，本APP不承担任何责任。 </p>
		<p>第9条   服务暂停、中断或终止</p>
		<p>9.1. 草莓商城有权基于自身判断，在认为您账户可能发生危害交易安全等情形时，不经通知您而采取暂停或关闭您的账号、冻结账号内余额、关闭相应交易订单、停止发货等措施，并将注册资料移除或删除， 且无需对您或任何第三方承担任何责任。前述情形包括但不限于： 1)   您提供的个人资料不具有真实性、有效性或完整性； 2) 您的交易存在异常或有疑义或有违法之虞时； 3) 您已经违反本协议中规定的各类规则及精神； 4) 您利用本APP传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论， 煽动民族仇恨、民族歧视、破坏民族团结的言论； 5) 您利用本APP从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动； 6) 您干扰本APP的正常运转，侵入本APP及国家计算机信息系统； 7) 您传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料； 8) 您利用任何非法手段获取其他用户个人信息，将其他用户信息用于任何营利或非营利目的，泄露其他用户或权利人的个人隐私； 9) 您发布任何侵犯他人著作权、商标权等知识产权或其他合法权利的内容；如果有其他用户或权利人发现您发布的信息涉嫌知识产权、或其他合法权益争议并告知本APP的； </p>
		<p>9.2. 您不得将在本APP注册获得的账号、密码等账户信息提供给他人使用，否则您应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
		<p>第10条   所有权及知识产权条款</p>
		<p>10.1. 您一旦接受本协议，即表明您主动将其在任何时间段在本APP发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于： 复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给草莓商城所有，您同意草莓商城有权就任何主体侵权而单独提起诉讼。</p>
		<p>10.2. 本协议已经构成著作财产权等权利转让书面协议，其效力及于您在草莓商城网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
		<p>10.3. 您同意并已充分了解本协议的条款，承诺不将已发表于本APP的信息，以任何形式发布或授权其他主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。 </p>
		<p>10.4. 除法律另有强制性规定外，未经草莓商城明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本APP的信息内容，否则，草莓商城有权追究其法律责任。 </p>
		<p>10.5. 本APP所刊登的资料信息（包括但不限于文字、图表、商标、logo、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件等），均是草莓商城或其内容提供者的财产，受中国和国际相关版权法规、公约等的保护，未经书面许可，任何第三方无权将上述资料信息复制、出版、发行、公开展示、编码、翻译、传输或散布至任何其他计算机、服务器、网站或其他媒介。本APP上所有内容的汇编是草莓商城的排他财产，受中国和国际版权法的保护。本APP上所有软件都是草莓商城或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。您不得鼓励、协助或授权任何其他人复制、修改、反向工程、反向编译或反汇编、拆解或者试图篡改全部或部分软件，或利用软件创设衍生产品。</p>
		<p>第11条   责任限制及不承诺担保</p>
		<p>11.1. 除非另有明确的书面说明,本APP及其所包含的或以其他方式通过本APP提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。 </p>
		<p>11.2. 除非另有明确的书面说明, 草莓商城不对本APP的运营及其包含在本APP上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
		<p>11.3. 草莓商城不担保本APP所包含的或以其他方式通过本APP提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本APP发出的电子信件、信息没有病毒或其他有害成分。 </p>
		<p>11.4. 您了解并同意，草莓商城有权应国家有关机关的要求，向其提供您在草莓商城的用户信息和交易记录等必要信息。如您涉嫌侵犯他人合法权益，则草莓商城有权在初步判断涉嫌侵权行为可能存在的情况下，向权利人提供您必要的个人信息。</p>
		<p>第12条   责任范围</p>
		<p>12.1. 因本APP或者涉及的第三方网站的设备、系统存在缺陷、黑客攻击、网络故障、电力中断、计算机病毒或其他不可抗力因素造成的损失，草莓商城不承担赔偿责任。</p>
		<p>12.2. 您账户的暂停、中断或终止不代表您责任的终止，您仍应对使用草莓商城服务期间的行为承担可能的违约或损害赔偿责任，同时草莓商城仍可保有您的相关信息。</p>
		<p>12.3. 草莓商城不对任何您及/或任何交易提供任何担保或条件或保证，无论是明示、默示或法定的。鉴于本APP仅为互联网信息提供平台，草莓商城不能完全保证交易各方提供并展示的信息 内容的真实性、充分性、可靠性、准确性、完整性和有效性，并且无需承担任何由此引起的法律责任。 </p>
		<p>12.4. 您依赖于您自身独立判断进行交易，并应对其作出的判断承担全部责任。</p>
		<p>12.5. 在任何情况下，对于您使用草莓商城服务过程中涉及由第三方提供相关服务的责任由该第三方承担，草莓商城不承担该等责任。因您自身的原因导致草莓商城服务无法提供或提供时发生任何错误而产生的任何损失或责任，由您自行负责，草莓商城不承担责任。</p>
		<p>12.6. 您违反本协议或任何法律、法规或侵害第三方的权利，而引起第三方对草莓商城提出的任何形式的索赔、要求、诉讼等主张，草莓商城有权向您追偿草莓商城的全部损失， 包括但不限于法律费用、名誉损失、及向第三方支付的补偿金等。 </p>
		<p>第13条   法律管辖和适用</p>
		<p>本协议的订立、执行和解释及争议的解决均适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释， 而其他条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向草莓商城所在地法院提起诉讼。 </p>
		<p>第14条   其他</p>
		<p>14.1. 草莓商城网站所有者是指在政府部门依法许可或备案的草莓商城APP经营主体。 </p>
		<p>14.2. 草莓商城尊重您的合法权利，本协议及本APP上发布的各类规则、声明、售后服务政策等其他内容，均是为了更好的、更加便利地为您提供服务。本APP欢迎您和社会各界提出意见和建议，草莓商城将虚心接受并适时修改本协议及本APP上的各类规则。</p>
		<p>14.3. 您点击本协议下方的“同意并继续”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>
	</div>
	<footer>
		<span @click="qux()" >取消</span>
		<span @click="tyi()" >已阅读并同意</span>
	</footer>
	</div>
	
</template>

<script>
	import {mapGetters,mapActions} from "vuex";
export default{
	name:"Comm",
	data(){
		return {
			tit:"注册协议"
		}
	},
	methods: {
		qux(){
			this.$store.commit("agree",false)
			this.$router.go(-1)
		},
		tyi(){
			this.$store.commit("agree",true)
			this.$router.go(-1)
		}
	},
	mounted(){
		this.$emit("senddata",this.tit)
	}
	
}
</script>

<style scoped="">
	.xieyi{
		display:flex;
		flex-flow: column;
		height:100%;
	}
	.artic{
		background:#fff;
		overflow:auto;
		padding:0 0.35rem;
		flex:1;
		height:92%;
	}
	
	h1{
		font-size:0.54rem;
		line-height:1.74rem;
		text-align:center;
	}
	
	.artic p{
		font-size:0.3rem;
		line-height:0.48rem;
		margin-bottom:0.3rem;
		font-weight:600;
	}
	p:first-of-type{text-indent:2em;}
	
	
	footer{
		height:8%;
		background:#e8e8e8;
		display:flex;
		justify-content: space-between;
		align-items:center;
		
	}
	span{
		color:#00f;
		font-size:0.32rem;
		padding:0 0.3rem;
	}
	
</style>
